test_cases/OAT15_URANS/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

kInlet          8.557;

internalField   uniform $kInlet;

boundaryField
{
    outerBoundary
    {
        type            inletOutlet;
        inletValue      uniform $kInlet;
        value           uniform $kInlet;
    }

    airfoil
    {
        type            fixedValue;
        value           uniform 0;
    }

    Front
    {
        type            empty;
    }

    Back
    {
        type            empty;
    }
    
    processor
    {
        type  processor;
        value $internalField;
    }
}

// ************************************************************************* //
